## Terraform Plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.compute.google_cloud_run_v2_job.ingestion will be created
  + resource "google_cloud_run_v2_job" "ingestion" {
      + conditions               = (known after apply)
      + create_time              = (known after apply)
      + creator                  = (known after apply)
      + delete_time              = (known after apply)
      + effective_annotations    = (known after apply)
      + effective_labels         = (known after apply)
      + etag                     = (known after apply)
      + execution_count          = (known after apply)
      + expire_time              = (known after apply)
      + generation               = (known after apply)
      + id                       = (known after apply)
      + last_modifier            = (known after apply)
      + latest_created_execution = (known after apply)
      + launch_stage             = (known after apply)
      + location                 = "europe-west1"
      + name                     = "datatalent-ingestion-job"
      + observed_generation      = (known after apply)
      + project                  = "cartographie-data-engineer"
      + reconciling              = (known after apply)
      + terminal_condition       = (known after apply)
      + terraform_labels         = (known after apply)
      + uid                      = (known after apply)
      + update_time              = (known after apply)

      + template {
          + parallelism = (known after apply)
          + task_count  = (known after apply)

          + template {
              + execution_environment = (known after apply)
              + max_retries           = 1
              + service_account       = "ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
              + timeout               = "1800s"

              + containers {
                  + image = "europe-west1-docker.pkg.dev/cartographie-data-engineer/datatalent/ingestion:latest"

                  + env {
                      + name  = "GCP_PROJECT_ID"
                      + value = "cartographie-data-engineer"
                    }
                  + env {
                      + name  = "INGESTION_FRANCE_TRAVAIL_PREFIX"
                      + value = "raw/france_travail/"
                    }
                  + env {
                      + name  = "INGESTION_GEO_PREFIX"
                      + value = "raw/geo/"
                    }
                  + env {
                      + name  = "INGESTION_RAW_BUCKET"
                      + value = "datatalent-dev-cartographie-data-engineer-raw"
                    }
                  + env {
                      + name  = "INGESTION_SIRENE_PREFIX"
                      + value = "raw/sirene/"
                    }
                  + env {
                      + name = "DATAGOUV_API_KEY"

                      + value_source {
                          + secret_key_ref {
                              + secret  = "DATAGOUV_API_KEY"
                              + version = "latest"
                            }
                        }
                    }
                  + env {
                      + name = "FT_CLIENT_ID"

                      + value_source {
                          + secret_key_ref {
                              + secret  = "FT_CLIENT_ID"
                              + version = "latest"
                            }
                        }
                    }
                  + env {
                      + name = "FT_CLIENT_SECRET"

                      + value_source {
                          + secret_key_ref {
                              + secret  = "FT_CLIENT_SECRET"
                              + version = "latest"
                            }
                        }
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }
    }

  # module.compute.google_cloud_run_v2_job_iam_member.job_invoker["ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"] will be created
  + resource "google_cloud_run_v2_job_iam_member" "job_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "serviceAccount:ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
      + name     = "datatalent-ingestion-job"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

  # module.compute.google_project_iam_member.cloud_run_service_agent_artifact_registry_reader will be created
  + resource "google_project_iam_member" "cloud_run_service_agent_artifact_registry_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-839133795234@serverless-robot-prod.iam.gserviceaccount.com"
      + project = "cartographie-data-engineer"
      + role    = "roles/artifactregistry.reader"
    }

  # module.compute.google_project_iam_member.ingestion_artifact_registry_reader[0] will be created
  + resource "google_project_iam_member" "ingestion_artifact_registry_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
      + project = "cartographie-data-engineer"
      + role    = "roles/artifactregistry.reader"
    }

  # module.compute.google_project_iam_member.job_invoker["ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"] will be destroyed
  # (because google_project_iam_member.job_invoker is not in configuration)
  - resource "google_project_iam_member" "job_invoker" {
      - etag    = "BwZM1coEYMQ=" -> null
      - id      = "cartographie-data-engineer/roles/run.invoker/serviceAccount:ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com" -> null
      - project = "cartographie-data-engineer" -> null
      - role    = "roles/run.invoker" -> null
    }

  # module.scheduler.google_cloud_scheduler_job.ingestion["france_travail"] will be created
  + resource "google_cloud_scheduler_job" "ingestion" {
      + attempt_deadline = "320s"
      + description      = "Trigger Cloud Run Job for source france_travail"
      + id               = (known after apply)
      + name             = "datatalent-ingestion-france_travail"
      + paused           = (known after apply)
      + project          = "cartographie-data-engineer"
      + region           = "europe-west1"
      + schedule         = "0 6 * * *"
      + state            = (known after apply)
      + time_zone        = "Europe/Paris"

      + http_target {
          + body        = "eyJvdmVycmlkZXMiOnsiY29udGFpbmVyT3ZlcnJpZGVzIjpbeyJlbnYiOlt7Im5hbWUiOiJJTkdFU1RJT05fU09VUkNFIiwidmFsdWUiOiJmcmFuY2VfdHJhdmFpbCJ9XX1dfX0="
          + headers     = {
              + "Content-Type" = "application/json"
            }
          + http_method = "POST"
          + uri         = "https://run.googleapis.com/v2/projects/cartographie-data-engineer/locations/europe-west1/jobs/datatalent-ingestion-job:run"

          + oauth_token {
              + scope                 = "https://www.googleapis.com/auth/cloud-platform"
              + service_account_email = "ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

  # module.scheduler.google_cloud_scheduler_job.ingestion["geo"] will be created
  + resource "google_cloud_scheduler_job" "ingestion" {
      + attempt_deadline = "320s"
      + description      = "Trigger Cloud Run Job for source geo"
      + id               = (known after apply)
      + name             = "datatalent-ingestion-geo"
      + paused           = (known after apply)
      + project          = "cartographie-data-engineer"
      + region           = "europe-west1"
      + schedule         = "0 4 1 * *"
      + state            = (known after apply)
      + time_zone        = "Europe/Paris"

      + http_target {
          + body        = "eyJvdmVycmlkZXMiOnsiY29udGFpbmVyT3ZlcnJpZGVzIjpbeyJlbnYiOlt7Im5hbWUiOiJJTkdFU1RJT05fU09VUkNFIiwidmFsdWUiOiJnZW8ifV19XX19"
          + headers     = {
              + "Content-Type" = "application/json"
            }
          + http_method = "POST"
          + uri         = "https://run.googleapis.com/v2/projects/cartographie-data-engineer/locations/europe-west1/jobs/datatalent-ingestion-job:run"

          + oauth_token {
              + scope                 = "https://www.googleapis.com/auth/cloud-platform"
              + service_account_email = "ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

  # module.scheduler.google_cloud_scheduler_job.ingestion["sirene"] will be created
  + resource "google_cloud_scheduler_job" "ingestion" {
      + attempt_deadline = "320s"
      + description      = "Trigger Cloud Run Job for source sirene"
      + id               = (known after apply)
      + name             = "datatalent-ingestion-sirene"
      + paused           = (known after apply)
      + project          = "cartographie-data-engineer"
      + region           = "europe-west1"
      + schedule         = "0 3 1 * *"
      + state            = (known after apply)
      + time_zone        = "Europe/Paris"

      + http_target {
          + body        = "eyJvdmVycmlkZXMiOnsiY29udGFpbmVyT3ZlcnJpZGVzIjpbeyJlbnYiOlt7Im5hbWUiOiJJTkdFU1RJT05fU09VUkNFIiwidmFsdWUiOiJzaXJlbmUifV19XX19"
          + headers     = {
              + "Content-Type" = "application/json"
            }
          + http_method = "POST"
          + uri         = "https://run.googleapis.com/v2/projects/cartographie-data-engineer/locations/europe-west1/jobs/datatalent-ingestion-job:run"

          + oauth_token {
              + scope                 = "https://www.googleapis.com/auth/cloud-platform"
              + service_account_email = "ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

  # module.storage.google_storage_bucket.raw will be created
  + resource "google_storage_bucket" "raw" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "datatalent-dev-cartographie-data-engineer-raw"
      + project                     = "cartographie-data-engineer"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + age                    = 365
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + send_age_if_zero       = true
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.storage.google_storage_bucket_iam_member.ingestion_object_admin[0] will be created
  + resource "google_storage_bucket_iam_member" "ingestion_object_admin" {
      + bucket = "datatalent-dev-cartographie-data-engineer-raw"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.warehouse.google_bigquery_dataset.marts will be created
  + resource "google_bigquery_dataset" "marts" {
      + creation_time              = (known after apply)
      + dataset_id                 = "marts"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "EU"
      + max_time_travel_hours      = (known after apply)
      + project                    = "cartographie-data-engineer"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.warehouse.google_bigquery_dataset.raw will be created
  + resource "google_bigquery_dataset" "raw" {
      + creation_time              = (known after apply)
      + dataset_id                 = "raw"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "EU"
      + max_time_travel_hours      = (known after apply)
      + project                    = "cartographie-data-engineer"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.warehouse.google_bigquery_dataset.staging will be created
  + resource "google_bigquery_dataset" "staging" {
      + creation_time              = (known after apply)
      + dataset_id                 = "staging"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "EU"
      + max_time_travel_hours      = (known after apply)
      + project                    = "cartographie-data-engineer"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.warehouse.google_bigquery_dataset_iam_member.dashboard_marts_viewer[0] will be created
  + resource "google_bigquery_dataset_iam_member" "dashboard_marts_viewer" {
      + dataset_id = "marts"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:dashboard-sa@cartographie-data-engineer.iam.gserviceaccount.com"
      + project    = "cartographie-data-engineer"
      + role       = "roles/bigquery.dataViewer"
    }

  # module.warehouse.google_bigquery_dataset_iam_member.dbt_marts_editor[0] will be created
  + resource "google_bigquery_dataset_iam_member" "dbt_marts_editor" {
      + dataset_id = "marts"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:dbt-sa@cartographie-data-engineer.iam.gserviceaccount.com"
      + project    = "cartographie-data-engineer"
      + role       = "roles/bigquery.dataEditor"
    }

  # module.warehouse.google_bigquery_dataset_iam_member.dbt_raw_viewer[0] will be created
  + resource "google_bigquery_dataset_iam_member" "dbt_raw_viewer" {
      + dataset_id = "raw"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:dbt-sa@cartographie-data-engineer.iam.gserviceaccount.com"
      + project    = "cartographie-data-engineer"
      + role       = "roles/bigquery.dataViewer"
    }

  # module.warehouse.google_bigquery_dataset_iam_member.dbt_staging_editor[0] will be created
  + resource "google_bigquery_dataset_iam_member" "dbt_staging_editor" {
      + dataset_id = "staging"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:dbt-sa@cartographie-data-engineer.iam.gserviceaccount.com"
      + project    = "cartographie-data-engineer"
      + role       = "roles/bigquery.dataEditor"
    }

  # module.warehouse.google_bigquery_dataset_iam_member.ingestion_raw_editor[0] will be created
  + resource "google_bigquery_dataset_iam_member" "ingestion_raw_editor" {
      + dataset_id = "raw"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
      + project    = "cartographie-data-engineer"
      + role       = "roles/bigquery.dataEditor"
    }

  # module.warehouse.google_project_iam_member.dashboard_job_user[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "google_project_iam_member" "dashboard_job_user" {
      - etag    = "BwZM1coEYMQ=" -> null
      - id      = "cartographie-data-engineer/roles/bigquery.jobUser/serviceAccount:dashboard-sa@cartographie-data-engineer.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:dashboard-sa@cartographie-data-engineer.iam.gserviceaccount.com" -> null
      - project = "cartographie-data-engineer" -> null
      - role    = "roles/bigquery.jobUser" -> null
    }

  # module.warehouse.google_project_iam_member.dbt_job_user[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "google_project_iam_member" "dbt_job_user" {
      - etag    = "BwZM1coEYMQ=" -> null
      - id      = "cartographie-data-engineer/roles/bigquery.jobUser/serviceAccount:dbt-sa@cartographie-data-engineer.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:dbt-sa@cartographie-data-engineer.iam.gserviceaccount.com" -> null
      - project = "cartographie-data-engineer" -> null
      - role    = "roles/bigquery.jobUser" -> null
    }

  # module.warehouse.google_project_iam_member.ingestion_job_user[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "google_project_iam_member" "ingestion_job_user" {
      - etag    = "BwZM1coEYMQ=" -> null
      - id      = "cartographie-data-engineer/roles/bigquery.jobUser/serviceAccount:ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com" -> null
      - project = "cartographie-data-engineer" -> null
      - role    = "roles/bigquery.jobUser" -> null
    }

Plan: 17 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  + raw_bucket_url      = (known after apply)

```